Revit 2021.1 API
FormatOptions Properties
The FormatOptions type exposes the following members.
Properties
Name | Description
Accuracy
 The accuracy to which values will be rounded.
DisplayUnits |  Obsolete.
 The units and display format used to format values.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
RoundingMethod
 The method used to round values: round to nearest, round up, or round down.
SuppressLeadingZeros
 Indicates if leading zeros should be suppressed in feet and fractional inches.
SuppressSpaces
 Indicates if spaces around the dash should be suppressed in feet and fractional inches.
SuppressTrailingZeros
 Indicates if trailing zeros after the decimal point should be suppressed.
UnitSymbol |  Obsolete.
 The unit symbol that should be displayed to indicate the units of the value.
UseDefault
 Indicates whether default or custom formatting should be used.
UseDigitGrouping
 Indicates if digit grouping symbols should be displayed.
UsePlusPrefix
 Indicates if a plus sign prefix should be displayed for positive and zero values.
See Also
FormatOptions Class
Autodesk.Revit.DB Namespace